# ExternalResourceSubFolder Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceSubFolder Constructor
ExternalResourceSubFolder Class See Also
---
Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public ExternalResourceSubFolder()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExternalResourceSubFolder()
```

# See Also
ExternalResourceSubFolder Class
ExternalResourceSubFolder Overload
Autodesk.Revit.DB Namespace